
#ifndef RMF_H
#define RMF_H

#ifndef MAPSYST_H                        
  #include "mapsyst.h"                   
#endif

#define VERSION_RMF      0x0200        // χεPσιρ στςυλτυςω 2.00 (ÒΑΣΤÒ ΞΟΧΟΗΟ ΖΟÒΝΑΤΑ, ΧΕÒΣΙΡ πΑΞΟÒΑΝΩ 7.0. ϊΑΗΟΜΟΧΟΛ ΧΩÒΟΧΞΕΞ.)
#ifdef LINUXAPI                        
#define VERSION_RMF_TURN 0x54000002    // χεPσιρ στςυλτυςω
#endif

//#define                0x0101        // χεPσιρ στςυλτυςω 1.01 (ÒΑΣΤÒ ΣΤΑÒΟΗΟ ΖΟÒΝΑΤΑ. χ ΛΟΞΕΓ ΪΑΠΙΣΑΞ ΪΑΗΟΜΟΧΟΛ ΞΟΧΟΗΟ ΖΟÒΝΑΤΑ. ϊΑΗΟΜΟΧΟΛ ΞΟΧΟΗΟ ΖΟÒΝΑΤΑ ΞΕ ΧΩÒΟΧΞΕΞ.)
#define VERSION_RMF_102  0x0102        // χεPσιρ στςυλτυςω 1.02 (ÒΑΣΤÒ ΞΟΧΟΗΟ ΖΟÒΝΑΤΑ, ΧΕÒΣΙΡ πΑΞΟÒΑΝΩ 6.0. ϊΑΗΟΜΟΧΟΛ ΞΕ ΧΩÒΟΧΞΕΞ.)
#define VERSION_RMF_103  0x0103        // χεPσιρ στςυλτυςω 1.03 (ÒΑΣΤÒ ΣΤΑÒΟΗΟ ΖΟÒΝΑΤΑ. χ ΛΟΞΕΓ ΪΑΠΙΣΑΞ ΪΑΗΟΜΟΧΟΛ ΞΟΧΟΗΟ ΖΟÒΝΑΤΑ. ϊΑΗΟΜΟΧΟΛ ΞΟΧΟΗΟ ΖΟÒΝΑΤΑ ΧΩÒΟΧΞΕΞ.) 

#define LABEL_MTW       0x0057544DL    //(MTW) νατςιγα χωσοτ ςεμψεζα
#define LABEL_MTW_TURN  0x4D545700L    //(MTW) νατςιγα χωσοτ ςεμψεζα


#define LABEL_RSW       0x00575352L    //(RSW) ςαστς
#define LABEL_RSW_TURN  0x52535700L    //(RSW) ςαστς  
#define LABEL_MTL       0x004C544DL    //(MTL) νατςιγα χωσοτ ςεμψεζα
                                       // ι σμοεχ νούξοστεκ οβÿενξωθ
                                       // οβÿελτοχ
#define LABEL_MTQ       0x0051544DL    //(MTQ) νατςιγα λαώεστχ 
#define LABEL_RMF       0x58464D52L    //(RMFX) δοβαχοώξωκ ζακμ
#define LABEL_RMF_TURN  0x524D4658L    //(RMFX) δοβαχοώξωκ ζακμ

#define RSW_VISIBILITY  0x56575352L    //(RSWV) ςΑΣΤÒ ΪΟΞΩ ΧΙΔΙΝΟΣΤΙ
                                       //(ΙΣΠΟΜΨΪΥΕΤΣΡ Χ ΠΟΜΕ UserLabel) 
#define RSW_QUALITY     0x51575352L    //(RSWQ) ςΑΣΤÒ ΛΑήΕΣΤΧΑ
                                       //(ΙΣΠΟΜΨΪΥΕΤΣΡ Χ ΠΟΜΕ UserLabel) 
#define RSW_WEB         0x57575352L    //(RSWW) ςΑΣΤÒΟΧΑΡ ΛΑÒΤΑ ΔΜΡ WEB
                                       //(ΙΣΠΟΜΨΪΥΕΤΣΡ Χ ΠΟΜΕ UserLabel) 

#define RMF_MAXFILESIZE  0xFFFFFF00L   //νΑΛΣΙΝΑΜΨΞΩΚ ÒΑΪΝΕÒ ΔΟΒΑΧΟήΞΟΗΟ ΖΑΚΜΑ 

typedef struct RMF              // ςαϊνες ϊαηομοχλα 320 βακτ
{
  ULONG Label;             // ιδεξτιζιλατος ξαώαμα ζακμα
                                   // (RSW0, MTW0, MTL0)
  ULONG Version;           // χεςσιρ στςυλτυςω
  ULONG Length;            // δμιHα ζακμα σ ϊαηομοχλον
  ULONG DuplicateOffset;   // σνεύεξιε ξα υνεξψϋεξξυΰ λοπιΰ
                                   //   (οτξοσιτεμψξο ξαώαμα ζακμα)
  ULONG UserLabel;         // πομψϊοχατεμψσλικ ιδεξτιζιλατος
                                                     // 0x0014 (020)
           char UserName[32];      // υσμοχξοε ινρ
           LONG ElementSize;       // ςαϊνες όμενεHτα (βιτ)
           LONG Height;            // χωσοτα χ όμενεHταθ
           LONG Width;             // ϋιςιξα χ όμενεHταθ
                                                     // 0x0040 (064)
           LONG BlockColumnCount;  // λ-χο στομβγοχ βμολοχ (βμολοχ χ στςολε)
           LONG BlockStringCount;  // λ-χο στςολ βμολοχ (βμολοχ χ στομβγε)
           LONG BlockHeight;       // λ-χο στςολ χ βμολε
           LONG BlockWidth;        // λ-χο στομβγοχ χ βμολε
           LONG TruncBlockHeight;  // λ-χο στςολ χ βμολε ξιφHεηο ςρδα
           LONG TruncBlockWidth;   // λ-χο στομβγοχ χ βμολε πςαχοκ λομοHλι
                                                     // 0x0058 (088)
  ULONG BorderOffset;      // σνεύεξιε ξα ςανλυ
           LONG BorderLength;      // δμιξα ϊαπισι "ςανλα"
  ULONG PaletteOffset;     // σνεύεξιε ξα παμιτςυ
           LONG PaletteLength;     // δμιξα ϊαπισι "παμιτςα"
  ULONG BlockDescOffset;   // σνεύεξιε ξα νασσιχ οπισατεμεκ βμολοχ
           LONG BlockDescLength;   // δμιξα ϊαπισι "οπισατεμι βμολοχ"
                                   // τιπ πομρ "οπισατεμψ βμολα" - BLOCKDESC
                                                     // 0x0070 (112)
  ULONG CompressDataOffset;// (ΠΟΛΑ ΞΕ ΙΣΠΟΜΨΪΥΐΤΣΡ)
           LONG CompressDataLength;//
           LONG CompressDataCount; //
                                                     // 0x007C (124)
           LONG MapType;           // τιπ λαςτω
           LONG ProjectionType;    // τιπ πςοελγιι (πÒΟΕΛΓΙΡ ΙΣΘ. ΝΑΤΕÒΙΑΜΑ) 
           LONG AlignReserv;       // ςεϊεςχ χωςαχξιχαξιρ 

                                                     // 0x0088 (136)
  double        Scale;             // νασϋταβ
  double        Precision;         // ώισμο όμενεξτοχ ξα νετς
  double        MeterInElement;    // λομιώεστχο νετςοχ νεστξοστι ξα όμενεξτ
  double        LocationX;         // λοοςδιξατω μεχοηο ξιφξεηο υημα
                                   // ςαστςα(νατςιγω) χ πςρνουηομψξοκ σιστενε
  double        LocationY;         // λοοςδιξατ
                                                     // 0x00B0 (176)
  double        FirstMainParallel; // πεςχαρ ημαχξαρ παςαμμεμψ
  double        SecondMainParallel;// χτοςαρ ημαχξαρ παςαμμεμψ
  double        AxisMeridian;      // οσεχοκ νεςιδιαξ
  double        MainPointParallel; // παςαμμεμψ ημαχξοκ τοώλι

                                                     // 0x00D0 (208)
  unsigned char CompressNumber;    // ξονες αμηοςιτνα σφατιρ βμολοχ
  unsigned char MaskType;          // τιπ τεξεχοκ νασλι (0 - 8)
  unsigned char MaskStep;          // ϋαη τεξεχοκ νασλι (0 - 3)
  unsigned char BorderOff;         // ζμαη οτλμΰώεξιρ ςανλι (ΣΝ. BorderOffset)
                                                     // 0x00D4 (212)
  ULONG BlockFlagsOffset;  // σνεύεξιε ξα νασσιχ ζμαηοχ βμολοχ
           LONG BlockFlagsLength;  // δμιξα ϊαπισι "νασσιχ ζμαηοχ βμολοχ"
                                   // τιπ πομρ "ζμαη βμολα" - unsigned char :
                                   //   0 - βμολ χξε ςανλι
                                   //   1 - βμολ χξυτςι ςανλι
                                   //   2 - βμολ ξα ηςαξιγε ςανλι
                                                     // 0x00DC (220)
  ULONG Length0;           // δμιHα 0-ΗΟ ζακμα σ ϊαηομοχλον (ξε βομεε 4GB)
                                                     // 0x00E0 (224)
  ULONG Length1;           // δμιHα 1-ΗΟ ζακμα (ΠÒΟΔΟΜΦΕΞΙΕ 0-ΗΟ)
                                                     // 0x00E4 (228)
  unsigned char OffsetFactor;      // χεμιώιξα σδχιηα σνεύεξιρ δμρ ποδδεςφλι ζακμοχ
                                   // βομεε 4GB (ϊξαώεξιρ = 8, 16, ...) 
                                                     // 0x00E5 (229)
           char Bright;            // ρςλοστψ
           char Contrast;          // λοξτςαστ
           char Gamma;             // ηαννα-ζυξλγιρ
           char Reserve[3];        // ςεϊεςχ
  //----------------------------------------------------------------
  //  πομρ νατςιγω
  //----------------------------------------------------------------
  unsigned char Flag_LocationChanged; // ζμαη ιϊνεξεξιρ πομψϊοχατεμεν πςιχρϊλι νατςιγω  
  
  //----------------------------------------------------------------
  //  πομρ νατςιγω σμοεχ (MTL0)
  //----------------------------------------------------------------
                                                     // 0x00EC (236)
  ULONG LayerDescOffset;   // σνεύεξιε ξα ϊαπισψ "οπισατεμψ σμοεχ"
           LONG LayerDescLength;   // δμιξα ϊαπισι "οπισατεμψ σμοεχ"

  //----------------------------------------------------------------
  //  πομρ ςαστςα (RSW0)                             //
  //----------------------------------------------------------------
                                                     // 0x00F4 (244)
  unsigned char Flag_Location;     // ζμαη υσταξοχμεξξοστι πςιχρϊλι ςαστςα
  unsigned char Flag_Negative;     // ζμαη ιξχεςτιςοχαξιρ ιϊοβςαφεξιρ
                                   //   0 - ποϊιτιχ
                                   //   1 - ξεηατιχ
  unsigned char RswFree[2];        // χωςαχξιχαξιε δο 4-θ βακτ
                                                     // 0x00F8 (248)
  unsigned char InvisibleColors[32];  // ζμαηι ξεχιδινωθ γχετοχ

  //----------------------------------------------------------------
  // πομρ νατςιγω χωσοτ(MTW0), νατςιγω λαώεστχ(MTQ0), νατςιγω σμοεχ(MTL0)
  //----------------------------------------------------------------
                                                     // 0x0118 (280)
  double        Minimum;    // νιξιναμψξοε ϊξαώεξιε χωσοτω ςεμψεζα χ εδιξιγαθ νατςιγω
  double        Maximum;    // ναλσιναμψξοε ϊξαώεξιε χωσοτω ςεμψεζα χ εδιξιγαθ νατςιγω
  double        PseudoCode; // ϊξαώεξιε πσεχδολοδα
                                                     // 0x0130 (304)
  ULONG Measure;    // εδιξιγα ιϊνεςεξιρ πο χωσοτε
  unsigned char MtrType;    // τιπ νατςιγω :
                            //  0 - αβσομΰτξωε χωσοτω
                            //  1 - συνναςξωε χωσοτω
                            //  2 - οτξοσιτεμψξωε χωσοτω
                            //      ιμι πομψϊοχατεμψσλαρ νατςιγα
  unsigned char Method;  // νετοδ ποστςοεξιρ ποχεςθξοστι :  
                         //  0 - νετοδ ξε οπςεδεμεξ
                         //  1 - σςεδξεχϊχεϋεξξαρ ιξτεςπομργιρ πο 16 ξαπςαχμεξιρν,
                         //  2 - σςεδξεχϊχεϋεξξαρ ιξτεςπομργιρ πο 8 ξαπςαχμεξιρν,
                         //  8 - μιξεκξαρ ιξτεςπομργιρ πο σετλε χωσοτξωθ τοώελ
                         //     (χ νετοδε ισπομψϊυΰτσρ τομψλο τοώεώξωε οβÿελτω)
                         //  16 - πμοσλαρ ποχεςθξοστψ σ ξυμεχοκ χωσοτοκ

  unsigned char HeightSuper;  // χωσοτα πςι ποπαδαξιι χ όμενεξτ   
                              // βομεε οδξοηο οβÿελτα σ αβσομΰτξοκ
                              // χωσοτοκ (0 - σςεδξρρ, 1 - ναλσιναμψξαρ)


  unsigned char Extremum;     // ζμαη ζοςνιςοχαξιρ μολαμψξωθ όλστςενυνοχ   
                              //     (ΠÒΙ Method = 1,2) :
                              //  0 - μολαμψξωε όλστςενυνω ξε ζοςνιςυΰτσρ
                              //  1 - μολαμψξωε όλστςενυνω ζοςνιςυΰτσρ

  //----------------------------------------------------------------

                                                     // 0x0138 (312)
                              // σνεύεξιε ξα δοπομξιτεμψξοε οπισαξιε ςαστςα (νατςιγω)   
  ULONG AdditionOffset;
                              // δμιξα δοπομξιτεμψξοηο οπισαξιρ ςαστςα (νατςιγω)        
           LONG AdditionLength;
                              // τιπ στςυλτυςω δοπομξιτεμψξοηο οπισαξιρ - ADDITIONALDESC

                                                     // 0x0140 (320)
}
  RMF;


//---------------------
//   οπισατεμψ βμολα
//---------------------
typedef struct BLOCKDESC
{
  ULONG Offset;
  ULONG Length;
}
  BLOCKDESC;


//------------------------------------------------------------------
//   δοπομξιτεμψξοε οπισαξιε ςαστςα ( νατςιγω )           
//------------------------------------------------------------------
typedef struct RMFADDITION  // ςαϊνες στςυλτυςω 320 βακτ
{
  //----------------------------------------------------------------
  //  οβύιε πομρ
  //----------------------------------------------------------------
  ULONG MaskOffset;      // σνεύεξιε ξα νασλυ                      
           LONG MaskLength;      // δμιξα ϊαπισι "νασλα"                   

  double        PoleLatitude;    // ϋΙÒΟΤΑ ΠΟΜΐΣΑ ΠÒΟΕΛΓΙΙ                 
  double        PoleLongitude;   // δΟΜΗΟΤΑ ΠΟΜΐΣΑ ΠÒΟΕΛΓΙΙ                
  LONG          EllipsoideKind;  // χΙΔ άΜΜΙΠΣΟΙΔΑ                         
  LONG          HeightSystem;    // σΙΣΤΕΝΑ ΧΩΣΟΤ                          
  LONG          CoordinateSystem;// σΙΣΤΕΝΑ ΛΟΟÒΔΙΞΑΤ                      
  LONG          ZoneNumber;      // ϊΑΠΟΜΞΡΕΤΣΡ ΣΙΣΤΕΝΟΚ ΠÒΙ ΪΑΠÒΟΣΕ       
                                 // ΖΟÒΝΥΜΡÒΑ - ΞΟΝΕÒ ΪΟΞΩ ΤΟΠΟΛΑÒΤΩ


  char Reserve[23];              // ςεϊεςχ

  unsigned char MaskUse;         // ζμαη πςινεξεξιρ νασλι (ΣΝ. MaskOffset) 

  //----------------------------------------------------------------
  // πομρ νατςιγω χωσοτ (MTW0)
  //----------------------------------------------------------------

  double AbsHeightDifference;  // οϋιβλα ξαμοφεξιρ χωσοτ - αβσομΰτξαρ
                               // χεμιώιξα ςαϊξοστι χωσοτ οβÿελτοχ,
                               // ποπαδαΰύιθ χ όμενεξτω νατςιγω
                               // (χ εδιξιγαθ νατςιγω)

  //----------------------------------------------------------------
  // πομρ νατςιγω λαώεστχ (MTQ0)
  //----------------------------------------------------------------

  LONG   MatrixColorCount;     // ώισμο γχετοχ χ παμιτςε νατςιγω           


  char TotalReserve[244];      // ςεϊεςχ

}
  RMFADDITION;

#endif   // RMF_H
